[{"author":"BH Liddell Hart","title":"Scipio Africanus","amazon_link":"http:\/\/amzn.to\/2B5Efdo","category":"recent","notes_slug":null,"summary":"Biography of one of history's greatest generals, almost forgotten in our time.  Scipio defeated Hannibal, saving Rome from the brink of destruction and ensuring its ascendency.  Through Hart's analysis, many of Scipio's strategies are just as applicable to today's environment."},{"author":"Lawrence Freedman","title":"Strategy: A History","amazon_link":"http:\/\/amzn.to\/2z7hH7x","category":"recent","notes_slug":null,"summary":"History of the concept of strategy.  Got caught up with other responsibilities before I could build moment to get through it.  Shelving for now but will return to at a future date."},{"author":"Philip K. Dick","title":"The Man in the High Castle","amazon_link":"http:\/\/amzn.to\/2B5Esxc","category":"recent","notes_slug":null,"summary":"Realized I'd never read the original.  I didn't find it as dynamic as the TV series.  I read it on a flight, so I might need to revisit to see if I glossed over parts and missed some of the depth."},{"author":"Kurt Vonnegut","title":"Mother Night","amazon_link":"http:\/\/amzn.to\/2BEyzqg","category":"recent","notes_slug":null,"summary":"We are what we pretend to be."},{"author":"Kurt Vonnegut","title":"A Man Without a Country","amazon_link":"http:\/\/amzn.to\/2CST28P","category":"recent","notes_slug":null,"summary":"Vonnegut looks back on his life and on the state of our country.  Viewing the world through his eyes shows how truly ludicrous a place it is. "},{"author":"Adrian Goldsworthy","title":"Caesar","amazon_link":"http:\/\/amzn.to\/2htzIJx","category":"recent","notes_slug":null,"summary":"Though the Roman republic was already on life support, the story of the man that ended it.  Resumed my Roman History obsession recently.  Surprised how little I knew about the rest of his life."},{"author":"Nancy Forbes","title":"Faraday, Maxwell and the Electromagnetic Field","amazon_link":"http:\/\/amzn.to\/2B6w7cQ","category":"recent","notes_slug":null,"summary":"Story of who are likely the most dynamic pair of experimentalist and theoretician in the history of physics.  Faraday explored every possible experimental arrangement, reporting the results without , and Maxwell sythesized that work into a completely revolutionary view of how the electromagnetic field defines the interactions of everyday matter.  "},{"author":"Alex Soojung-Kim Pang","title":"Rest","amazon_link":"http:\/\/amzn.to\/2y74fTe","category":"recent","notes_slug":null,"summary":"I thought this was going to be as fluffy a book as some of the previous ones on solitude.  It's actually well-researched and argues that we see work and rest as binaries. Even more problematic, we think of rest as simply the absence of work, not as something that stands on its own or has its own qualities."},{"author":"Tim O'Reilly","title":"WTF: What's the Future","amazon_link":"http:\/\/amzn.to\/2ia5ybj","category":"recent","notes_slug":null,"summary":"How to think about the next years of technologic development from one of the original observers.  The book started out a bit too techno-cheerleader for me, but as it progressed I got more and more into it and his perspective.  I think it serves as an excellent guide to thinking about technology and society."},{"author":"Frank Ostaseski","title":"The Five Invitations","amazon_link":"http:\/\/amzn.to\/2pfpnm5","category":"recent","notes_slug":null,"summary":"What death can teach us about living fully.  Had a good friend die recently.  This helped put things in perspective."},{"author":"Jill Bolte Taylor","title":"My Stroke of Insight","amazon_link":"http:\/\/amzn.to\/2xs7SPy","category":"recent","notes_slug":null,"summary":"Author has a stroke.  Author is a neuroscientist able to relate things she's experiencing to deeper understanding of the nature of the self and consciousness.  Fascinating first half.  The second gets a bit too steeped in self-help language, but is interesting in spite of that. "},{"author":"Tom Wolfe","title":"The Electric Kool-Aid Acid Test","amazon_link":"http:\/\/amzn.to\/2yvySii","category":"recent","notes_slug":null,"summary":"The exploits of Ken Kesey and The Merry Pranksters.  I love the way Tom Wolfe covers every subject he touches."},{"author":"Peter Godfrey-Smith","title":"Other Minds","amazon_link":"http:\/\/amzn.to\/2wT50y9","category":"recent","notes_slug":null,"summary":"The ancestors of cephalopods branched off from the ancestors of humans long enough ago they may represent a coevolution of consciousness.  Touches on the evolution of consciousness and why exists at all."},{"author":"Robert Kull","title":"Solitude","amazon_link":"http:\/\/amzn.to\/2y7FB4i","category":"recent","notes_slug":null,"summary":"Author lives alone for a year on a remote island off the coast of Chile and writes about it.  Some insights, some fluff."},{"author":"Herbert Simon","title":"The Sciences of the Artificial","amazon_link":"http:\/\/amzn.to\/2y808G1","category":"recent","notes_slug":null,"summary":"Methods of thinking about artificial constructs we create in the world.  Relation of design to solving most constructud problems.  I couldn't get into it."},{"author":"John McPhee","title":"Assembling California","amazon_link":"http:\/\/amzn.to\/2i9V64b","category":"recent","notes_slug":null,"summary":"The geology and tectonic processes that created California.  Was too geologically dense for me, but I enjoyed the bits I could understand."},{"author":"Michael Harris","title":"Solitude","amazon_link":"http:\/\/amzn.to\/2vNC5JL","category":"recent","notes_slug":null,"summary":"First in a series of books on the value of solitude.  I'm fascinated by the concept at the moment, but this felt more like reverie with bits of pop neuroscience and complaining about modern digital technology sprinkled in, than containing an real insight."},{"author":"Kumiko Kakehashi","title":"So Sad to Fall in Battle","amazon_link":"http:\/\/amzn.to\/2xYwtx3","category":"recent","notes_slug":null,"summary":"The battle of Io Jima as seen through the letters of Japanese commanding General, Tadamichi Kuribayashi.  Doomed from the start, his outfit still managed to hold off an overwhelming force for months.  A true study in leadership."},{"author":"Jimmy Soni","title":"A Mind at Play","amazon_link":"http:\/\/amzn.to\/2wSPulK","category":"recent","notes_slug":null,"summary":"Biography of Claude Shannon, founder of the field information theory. His genius provided us the intellectual foundation for all modern communications.  The main thread of the book is how he managed to maintain levity with his work and approach problems playfully."},{"author":"Steven Lee Meyers","title":"The New Tsar","amazon_link":"http:\/\/amzn.to\/2xpSPKX","category":"recent","notes_slug":null,"summary":"Biography of Putin.  Started, made it a bit in and put it down.  Followed his undistinguished early career and didn't make it to his rise to power.  Will need to resume at some point."},{"author":"John Kruschke","title":"Doing Bayesian Data Analysis","amazon_link":"http:\/\/amzn.to\/2ofEY0g","category":"recent","notes_slug":null,"summary":"I think Bayesian methods are the future of statistical analysis.  This book provides a great practitioners introduction and a warm-up for the heavier-weight [Bayesian Data Analysis](http:\/\/amzn.to\/2eY17Su) by Gelman et al."},{"author":"Ian Goodfellow, Yoshua Bengio & Aaron Courville","title":"Deep Learning","amazon_link":"http:\/\/amzn.to\/2igiMC9","category":"recent","notes_slug":null,"summary":"The one and only textbook for deep learning.  If you're even remotely interested in the topic, you should own this.  The book presents from a theoretical standpoint, and pairs very well with [Practical Deep Learning for Coders](http:\/\/course.fast.ai\/) course.  Do both."}]