[{"author":"Nassim Taleb","title":"Antifragile","amazon_link":"http:\/\/amzn.to\/2iGZ9Cc","category":"favorite","notes_slug":null,"summary":"Culmination of Taleb's thesis spanning Fooled by Randomness and the Black Swan.  Exploring the concept of things that are not only robust to chaos, but actually thrive in it, across all spheres of life.  Also, I love how cranky he is.  I could listen to him yell at kids to get off his lawn all day."},{"author":"Cal Newport","title":"So Good They Can't Ignore You","amazon_link":"http:\/\/amzn.to\/2iH0lW7","category":"favorite","notes_slug":null,"summary":"Refuting the advice to \"follow your passion\", Cal deconstructs the best approach to building a meaningful career.  He proceeds to thoroughly map out an approach to define your professional life on your own terms, and gain the credibility to obtain it.  Quite possibly the best career book I've ever read."},{"author":"Wade Davis","title":"One River","amazon_link":"http:\/\/amzn.to\/2iGPMlR","category":"favorite","notes_slug":null,"summary":"Biography of Richard Evans Schultes, one of the most celebrated ethnobotanists to ever live, written by his protege.  Recounts his exploration of the Brazilian rainforest, weaving the stories of him, the people he meets, the plants, and the history of the land into one narrative.  "},{"author":"Eiji Yoshikawa","title":"Musashi","amazon_link":"http:\/\/amzn.to\/2iHcDxO","category":"favorite","notes_slug":null,"summary":"Historical fiction of the life of Miyamoto Musashi, the most renowned Japanese swordsman who ever lived.  A ronin's journey through Edo Period Japan for perfection of his art and purification of spirit. This novel reads much like Gone with the Wind, but with more people fighting with swords."},{"author":"Chris Kresser","title":"The Paleo Cure","amazon_link":"http:\/\/amzn.to\/2id3nUS","category":"favorite","notes_slug":null,"summary":"I've read a lot of books on the paleo diet and associated lifestyle.  This is far and away the best one, focusing how to use it theraputically.  It provides a clear conceptual framework on how to remove potentially irritating foods, then test whether you can tolerate them or not.  Then moves on to the other lifestyle modifications that can improve one's health.  The one book on diet I recommend to people."},{"author":"Walter Isaacson","title":"Benjamin Franklin: An American Life","amazon_link":"http:\/\/amzn.to\/2iGY1hL","category":"favorite","notes_slug":null,"summary":"Fantastic portrait into one of our country's founders (especially the first two thirds).  Franklin is quite the character and put a lot of thought into designing his life that's as applicable today as it was in the 18th century."},{"author":"Alfred Lansing","title":"Endurance: Shackleton's Incredible Voyage","amazon_link":"http:\/\/amzn.to\/2ia4m8p","category":"favorite","notes_slug":null,"summary":"The story of Shackleton's famed Antarctic expedition.  Despite his boat being destroyed and being trapped for 18 months, managed to get the entire crew home safely.  Perhaps one of the best studies of the quality of leadership. "},{"author":"Steven Pressfield","title":"Gates of Fire","amazon_link":"http:\/\/amzn.to\/2iGCslH","category":"favorite","notes_slug":null,"summary":"Fictional, yeh highly accurate, recounting of the battle of the Spartans and the battle of Thermopylae.  I could barely put it down."},{"author":"Steward Brand","title":"Whole Earth Discipline","amazon_link":"http:\/\/amzn.to\/2igfDSM","category":"favorite","notes_slug":null,"summary":"Argues that many of the things (nuclear power, GMO crops, etc...) viewed as ecological disasters have been exagerated, and may be necessary to avoid the larger ecological disaster of climate change.  If you're interested in climate change, this is your map."},{"author":"Sebastian Junger","title":"Tribe: On Homecoming and Belonging","amazon_link":"http:\/\/amzn.to\/2ijAw1R","category":"favorite","notes_slug":null,"summary":"Short but profound book on the nature of human connection and society. For all of the material weath modern society has us, it seems at odds with our evolutionary history and has not brought a similar increase in happiness, purpose and belonging."},{"author":"Richard Rhodes","title":"The Making of the Atomic Bomb","amazon_link":"http:\/\/amzn.to\/2qtaARX","category":"favorite","notes_slug":null,"summary":"Absolutely fascinating history of the making of one of the most amazing (and horrifying) scientific and technological achievements of humanity.  Rhodes does a stellar job of weaving the stories of the science, the people, the philosophy, the politics and the logistics.  Will read again."},{"author":"Jon Gertner","title":"The Idea Factory: Bell Labs","amazon_link":"http:\/\/amzn.to\/2mxeGGn","category":"favorite","notes_slug":null,"summary":"The story of one of the greatest sources of technological innovation in American history.  Lots of insight into the creation of new techologies and analysis of modern innovation."},{"author":"Wade Davis","title":"The Wayfinders: Why Ancient Wisdom Matters in the Modern World","amazon_link":"http:\/\/amzn.to\/2l0O6cG","category":"favorite","notes_slug":null,"summary":"The myriad of cultures of the world are not failed attempts at modernity, let alone failed attempts to be us. They are unique answers to a fundamental question: What does it mean to be human and alive?  Watch his [Long Now talk](http:\/\/longnow.org\/seminars\/02010\/jan\/13\/wayfinders-why-ancient-wisdom-matters-modern-world\/) as well."},{"author":"Marc Reisner","title":"Cadillac Desert","amazon_link":"http:\/\/amzn.to\/2xpprEu","category":"favorite","notes_slug":null,"summary":"The American West, the quest to provide water to an arid landscape when there simply isn't enough, and the birth of the modern welfare state in subsidized agriculture.  The story of the US west is story of its geography and climate."},{"author":"Colin Woodard","title":"American Nations","amazon_link":"http:\/\/amzn.to\/2sUmAxr","category":"favorite","notes_slug":null,"summary":"The separate histories of the 11 different groups that populated the United States, Canada and Northern Mexico, how they're interacted in the 500 year history of European settlement and how their histories explain our modurn situation."}]