[{"author":"Cixin Liu","title":"Death's End","amazon_link":"http:\/\/amzn.to\/2xZ0lci","category":null,"notes_slug":null,"summary":"Last of the Three-Body Series.  Progressed pretty slowly for me, partly retelling previous events from a different point of view, but the end more than made up for it.  The final view of the universe Liu paints at the end had my mind spinning for days."},{"author":"Cixin Liu","title":"The Dark Forest","amazon_link":"http:\/\/amzn.to\/2wiYkFS","category":null,"notes_slug":null,"summary":"Sophomore album.  Good in it's own right.  Great in the context of the trilogy."},{"author":"Cixin Liu","title":"The Three-Body Problem","amazon_link":"http:\/\/amzn.to\/2wT55BP","category":null,"notes_slug":null,"summary":"It's hard to evaluate each of the three books in the series on its own.  This had a bit of a slow start, but really drew me in after.  I read all three so quickly I forget exactly where one left off and the next started.  I'm not normally much a reader of science fiction, but this trilogy is highly recommended."},{"author":"James Watson","title":"The Double Helix","amazon_link":"http:\/\/amzn.to\/2gUQ1L1","category":null,"notes_slug":null,"summary":"Story of the discovering of the DNA helix from one of it's founders.  Got a few chapters in, but didn't really grab me."},{"author":"Edvard Radzinsky","title":"Stalin","amazon_link":"http:\/\/amzn.to\/2fPWZE7","category":null,"notes_slug":null,"summary":"Biography of one of the most ruthless and effective dictators ever.  Stalin inherited a rural peasantry and transformed it into an industrial superpower in 20 years, while waging war against Hitler, taking some 50 million lives in the process."},{"author":"Jack Weatherford","title":"Genghis Khan and the Making of the Modern World","amazon_link":"http:\/\/amzn.to\/2vIF6g5","category":null,"notes_slug":null,"summary":"The life of Tem'_jin and how the values the Mongols carried with the as they built their empire laid the foundation for much of what we consider the hallmarks of modernity."},{"author":"Yuval Noah Harari","title":"Homo Deus","amazon_link":"http:\/\/amzn.to\/2ozpWpI","category":null,"notes_slug":null,"summary":"Loved this book.  So much to say about how the next hundred years of technological development will fundamentally change what it means to be human."},{"author":"Tyler Cowen","title":"The Complacent Class","amazon_link":"http:\/\/amzn.to\/2vgXrgU","category":null,"notes_slug":null,"summary":"Prediction of the increasing tendancy for Americans to keep the country the way it is.  It didn't grab me as much as his previous two, and didn't pick it up after the flight I started it on."},{"author":"Twyla Tharp","title":"The Creative Habit","amazon_link":"http:\/\/amzn.to\/2ozgpyV","category":null,"notes_slug":null,"summary":"I've been trying to restart a creative thinking habit.  Picked the book up, put it down, then did so again.  I feel I got a better return on investment from The Artist's Way."},{"author":"Walter Isaacson","title":"The Innovators","amazon_link":"http:\/\/amzn.to\/2tQQyDO","category":null,"notes_slug":null,"summary":"The 150 year history of the hundreds of inventors and contributors that gave rise to personal computers, the Internet and the modern information age.  Similar in spirit to The Making of the Atomic Bomb in all the best ways possible."},{"author":"John Miles White","title":"Bandit Algorithms for Website Optimization","amazon_link":"http:\/\/amzn.to\/2vhk198","category":null,"notes_slug":null,"summary":"Basic coverage on the motivation and techniques for using multi-arm bandit algorithms to continually tweak websites."},{"author":"Ben Rich","title":"Skunkworks","amazon_link":"http:\/\/amzn.to\/2sUKp8k","category":null,"notes_slug":null,"summary":"History and accomplishments of Lockheed's special projects group responsible for the U2, the SR-71 and the stealth fighter amongst other aircraft.  A study in small teams doing amazingly innovative work."},{"author":"Vasily Grossman","title":"A Writer at War","amazon_link":"http:\/\/amzn.to\/2tQiTu0","category":null,"notes_slug":null,"summary":"Notes from one of the most widely traveled World War II Soviet reporters.  Grossman had nearly-unrestricted access to the Soviet Eastern Front and he paints a very comprehensive picture of life on the ground.  Chilling, to say the least."},{"author":"Dave Asprey","title":"Head Strong","amazon_link":"http:\/\/amzn.to\/2oznIqs","category":null,"notes_slug":null,"summary":"Tour of many approaches to improve cognitive function.  I do some already and will need to test the rest before reporting back on efficacy."},{"author":"Richard Rhodes","title":"Dark Sun","amazon_link":"http:\/\/amzn.to\/2rLKuxi","category":null,"notes_slug":null,"summary":"Followup to the excellent Making of the Atomic Bomb.  Expands coverage to include Russian scientific\/technical developments and espionage.  Somehow it didn't grab me as much and I put it down half way through."},{"author":"Massimo Pigliucci","title":"How to Be a Stoic","amazon_link":"http:\/\/amzn.to\/2q0E9wQ","category":null,"notes_slug":null,"summary":"Another book on Stoic philosophy.  A few good explanations, but mostly a rehash for me.  However, I think it's worth it for the practical spirtual exercises alone, which echo [Ben Franklin's virtues](http:\/\/www.thirteenvirtues.com\/)."},{"author":"Tom Wolfe","title":"The Right Stuff","amazon_link":"http:\/\/amzn.to\/2rOLD4D","category":null,"notes_slug":null,"summary":"History of the Mercury 7 program and the first astronauts.  Rocket planes, fighter-jock machismo and the willingness to place oneself in the path of danger to prove you have it.  I really enjoyed this."},{"author":"Cameron Davidson-Pilon","title":"Bayesian Methods for Hackers","amazon_link":"http:\/\/amzn.to\/2kyFu8v","category":null,"notes_slug":null,"summary":"Started it and immediately switched to [Doing Bayesian Data Analysis](http:\/\/amzn.to\/2ofEY0g) for more depth.  I find this book best as a tutorial for [PyMC3](https:\/\/pymc-devs.github.io\/pymc3\/)."},{"author":"James Gliek","title":"Genius: The Life and Science of Richard Feynman","amazon_link":"http:\/\/amzn.to\/2rfi4MQ","category":null,"notes_slug":null,"summary":"Doesn't play up his persona as much as [Surely You're Joking](http:\/\/amzn.to\/2qNdbZN) but covers the history and implications of his physics well.  I didn't find a whole lot new in it, but I've already read most other books on Feynman and his area."},{"author":"Chris Bellamy","title":"Absolute War","amazon_link":"http:\/\/amzn.to\/2ohqjmn","category":null,"notes_slug":null,"summary":"First in what I imagine will be many books about the Eastern Front of WWII.  I highly recommend Dan Carlin's [Ghosts of the Ostfront](http:\/\/www.dancarlin.com\/product\/hardcore-history-ghosts-ostfront-series\/) series, if you're at all curious. The book focused on military operations and the logistics of those movements, and vignettes of the major characters.  While I didn't want the book to be overwhelmed with stories from the front, I found the book glossed over it to a surprising degree.  If you skim too fast, you could miss a million deaths."},{"author":"Kim Zetter","title":"Countdown to Zero Day","amazon_link":"http:\/\/amzn.to\/2qnEMhZ","category":null,"notes_slug":null,"summary":"The story behind Stuxnet, sabotage of the Iranian nuclear program and the vulnerability of infrastructure in the coming age of cyber-warfare.  The future is scary."},{"author":"Daniel Coyle","title":"The Talent Code","amazon_link":"http:\/\/amzn.to\/2qiXoCF","category":null,"notes_slug":null,"summary":"What is necessary to give rise to talent, in any area.  I'm having trouble summarizing it, but there are some good gems among the pop-neuroscience and personal anecdotes."},{"author":"William Manchester","title":"The Last Lion: Winston Spencer Churchill: Defender of the Realm, 1940-1965","amazon_link":"http:\/\/amzn.to\/2p9cSZS","category":null,"notes_slug":null,"summary":"Continuing the previous biography about Churchill's time as Prime Minister during WWII.  I got too fascinated in the Eastern Front and stopped in favor of reading on that."},{"author":"Timothy C. Urdan","title":"Statistics in Plain English","amazon_link":"http:\/\/amzn.to\/2oztSqn","category":null,"notes_slug":null,"summary":"This is the intro frequentist statistics book I've been looking for.  There's dozens of books that cover the basic curriculum, but the majority either assume move too slowly for me or assume too much background.  This one hit the sweet spot."},{"author":"William Manchester","title":"The Last Lion: Winston Spencer Churchill: Alone, 1932-1940","amazon_link":"http:\/\/amzn.to\/2p3AqiF","category":null,"notes_slug":null,"summary":"2nd in a Winston Churchill biography trilogy.  My main takeaway was a greater understanding of the run-up to WWII."},{"author":"Oliver Sacks","title":"Gratitude","amazon_link":"http:\/\/amzn.to\/2miuyR1","category":null,"notes_slug":null,"summary":"Oliver Sacks looks back on his life and contemplates old age.  A short, endearing reminder of where one's priorities should be.  This one will be reread many times."},{"author":"David Diez, Christopher Barr & Mine Oetinkaya-Rundel","title":"OpenIntro Statistics","amazon_link":"http:\/\/amzn.to\/2iGIoek","category":null,"notes_slug":null,"summary":"Intro stats book.  Moved too slowly, and hand-waved away too many details for me.  If you want to understand this subject matter, I recommend [Statistics in Plain English](http:\/\/amzn.to\/2oztSqn) instead."},{"author":"Frank Herbert","title":"Dune","amazon_link":"http:\/\/amzn.to\/2lbslC9","category":null,"notes_slug":null,"summary":"Never fear, I've read it before; I'll read it again.  The hardcover edition was too good to pass up."},{"author":"Adam Steltzner","title":"The Right Kind of Crazy","amazon_link":"http:\/\/amzn.to\/2mx7Fp2","category":null,"notes_slug":null,"summary":"Book on curiosity and technical leadership (that is leading both technological development and the people doing it) by the JPL scientist responsible for the _Curiosity_ Sky Crane."},{"author":"Edward Hallowell","title":"Driven to Distraction","amazon_link":"http:\/\/amzn.to\/2i2CC1W","category":null,"notes_slug":null,"summary":"Definitive work on ADHD, especially in adults.  While most pertinent to those with ADHD, I think it's lessons broadly applicable.  On any topic, the best instruction often comes from the ones for which a skill comes the least naturally.  The systems and psychology that help the distractable get stuff done are of interest to all."},{"author":"Paul Kalanithi","title":"When Breath Becomes Air","amazon_link":"http:\/\/amzn.to\/2myfzOY","category":null,"notes_slug":null,"summary":"The words of the dying are perhaps the best advice on how to live."},{"author":"Norman MacRae","title":"John Von Neumann","amazon_link":"http:\/\/amzn.to\/2kBv8Z5","category":null,"notes_slug":null,"summary":"Father of the modern computer, among many other accomplishments.  While an innate genius (a term much overused, but truly warranted here) his skill was as much nuture as nature.  As such, the book provides nuggets to develop your own thinking skills."},{"author":"Elizabeth Dunn & Michael Norton","title":"Happy Money","amazon_link":"http:\/\/amzn.to\/2laGe4M","category":null,"notes_slug":null,"summary":"Survey of scientific literature regarding how money affects our emotional well-being.  Sadly, some of the examples confuse correlation and causation, but the overall advice is very useful to consider if you want to buy the most happiness for your dollar."},{"author":"Benjamin Todd","title":"80,000 Hours","amazon_link":"http:\/\/amzn.to\/2laUXvC","category":null,"notes_slug":null,"summary":"A well-reasoned examination of how to do the most social good with one's career, focused on readers just starting theirs. "},{"author":"Neal Stephenson","title":"Seveneves","amazon_link":"http:\/\/amzn.to\/2mywX6g","category":null,"notes_slug":null,"summary":"After writing Anathem, Neal asked himself \"what if instead of 90% plot and 10% orbital mechanics, the next book was the other way around?\"  Snark aside, I loved this, especially the first 2 acts."},{"author":"Neal Stephenson","title":"Anathem","amazon_link":"http:\/\/amzn.to\/2lXDElC","category":null,"notes_slug":null,"summary":"If academia decided to really double-down on the ivory town."},{"author":"Gordon Livingston","title":"Too Soon Old, Too Late Smart","amazon_link":"http:\/\/amzn.to\/2jnCH17","category":null,"notes_slug":null,"summary":"30 statements about making sense of mortality, relationships and modern life.  Some of the points hit so deeply it was physically uncomfortable to read at times.  This is one of those books you reread portions of every few months until the work their way into your being.  Recommended."},{"author":"Daniel Yergin","title":"The Quest","amazon_link":"http:\/\/amzn.to\/2iGKJ4P","category":null,"notes_slug":null,"summary":"Tackling the massive topic of global energy, politics, national security and the course of events that got us to the modern day.  Mostly told through small vignettes to illustrate particular points, this grabbed me much more than expected."},{"author":"Eric Greitens","title":"Resilience","amazon_link":"http:\/\/amzn.to\/2ig8IJl","category":null,"notes_slug":null,"summary":"Lessons on cultivating resiliance from a Navy Seal.  I made it through the first 100 pagse but it feels like a book to be digested in small chapters over time."},{"author":"Yuval Harari","title":"Sapiens","amazon_link":"http:\/\/amzn.to\/2j1iv5a","category":null,"notes_slug":null,"summary":"A Big History book ala Guns, Germs and Steel.  Interesting points but, similar to GG&S, the scope is so broad I found it difficult to overcome my skepticism that the author is only picking from the surface to support their chosen narrative. I read the first half and only skimmed the latter.  I may just not like the genre."},{"author":"Jean Edward Smith","title":"FDR","amazon_link":"http:\/\/amzn.to\/2iGwhho","category":null,"notes_slug":null,"summary":"Detailed biography of of the third great President, along with Washington and Lincoln.  I had not appreciated how much the current scope of the executive branch and the involvement of the US government in well-being of all Americans was a result of his terms.  See also PBS's exellent series [The Roosevelts](http:\/\/www.pbs.org\/kenburns\/the-roosevelts)."},{"author":"Arnold Bennett","title":"How to Live on 24 Hours a Day","amazon_link":"http:\/\/amzn.to\/2iH06dz","category":null,"notes_slug":null,"summary":"A short essay on how not to waste your life.  If Seneca's _On the Shortness of Life_ is the strategy, this is one set of simple tactics."},{"author":"Charles Mann","title":"1491","amazon_link":"http:\/\/amzn.to\/2iGYuQW","category":null,"notes_slug":null,"summary":"The New World as it actually was.  Contrary to what is taught in school, Columbus did not land in a sparsely settled, near-pristine wilderness and instead encountered a continent populated by advanced civilizations."},{"author":"John Vaillant","title":"The Tiger","amazon_link":"http:\/\/amzn.to\/2i9Z50A","category":null,"notes_slug":null,"summary":"Tiger in Russia turns man-eater.  Combo special ops\/animal warden team hunts tiger.  Tiger hunts them.  Insanity that is Russia.  Man vs. alpha preditor."},{"author":"Tim Ferriss","title":"Tools of Titans","amazon_link":"http:\/\/amzn.to\/2ia7rW8","category":null,"notes_slug":null,"summary":"Agree or disagrees Ferriss' priorities, he's excellent at distilling things down into actionable life-hacks.  This is his most wide-reaching book yet.  Lots of things to apply to your life."},{"author":"Ryan Avent","title":"The Wealth of Humans","amazon_link":"http:\/\/amzn.to\/2hv0kXw","category":null,"notes_slug":null,"summary":"How does technological progress alter the relationship of Labor and Capital.  What does the future look like when there isn't enough work for the members of society?  I can't tell whether the book was superficial or I simply didn't understand it."},{"author":"Daron Acemoglu & James Robinson","title":"Why Nations Fail","amazon_link":"http:\/\/amzn.to\/2ig8UIE","category":null,"notes_slug":null,"summary":"Extractive political and economic institutions that maintain advantage for the minority elite are largely responsible for why nations fail to develop economically."},{"author":"Steward Brand","title":"How Buildings Learn","amazon_link":"http:\/\/amzn.to\/2igd1UL","category":null,"notes_slug":null,"summary":"Got distracted half way through, but still got a lot out of it.  I've always considered architecture and software development to have interesting parallels and this reinforced that idea.  Biggest insight: certain buildings being like blue jeans where they improve with use and wear.  Many things that interest me share that concept."},{"author":"Mortimer Adler & Charles Van Doren","title":"How to Read a Book","amazon_link":"http:\/\/amzn.to\/2inkioh","category":null,"notes_slug":null,"summary":"How-to guide for reading books.  While seemingly obvious, most of us were not taught the skills necessary for digesting difficult reading material.  This book presents a 4-level approach for understanding great books.  Ironically, I didn't finish it."},{"author":"Christian Rudder","title":"Dataclysm","amazon_link":"http:\/\/amzn.to\/2hy15kg","category":null,"notes_slug":null,"summary":"A study of how of human behavior on social networks.  How do people think and act towards their fellow members of society when no ones looking.  Many of the problems that came to light in 2016 have been around for a long time."},{"author":"Reid Hoffman","title":"The Alliance","amazon_link":"http:\/\/amzn.to\/2iGJ8fk","category":null,"notes_slug":null,"summary":"Thoughts on the nature of modern employer-employee relationships.  Some takeaways for me, much of it for managers.  Might have been better as a longform blog post."},{"author":"Mark Manson","title":"The Subtle Art of Not Giving a F*ck","amazon_link":"http:\/\/amzn.to\/2iGL1Jg","category":null,"notes_slug":null,"summary":"Didn't grab me much.  I'd rather read [Seneca][Letters from a Stoic] or [Marcus][Meditations] again."},{"author":"John Steele Gordon","title":"An Empire of Wealth","amazon_link":"http:\/\/amzn.to\/2iGIeDA","category":null,"notes_slug":null,"summary":"A telling of the history of the United States through the lens of economics.  Role of central banks and markets.  Ability of the government to raise funds to wage war.  I really enjoyed this read."},{"author":"Brad Stone","title":"The Everything Store","amazon_link":"http:\/\/amzn.to\/2i9Zbpd","category":null,"notes_slug":null,"summary":"The story of Jeff Bezos and Amazon.  If you're at all interested in the expansion of Tech beyond purely digital pursuits, this book has many lessons."},{"author":"B. H. Liddell Hart","title":"Sherman: Soldier, Realist, American","amazon_link":"http:\/\/amzn.to\/2ia0TH5","category":null,"notes_slug":null,"summary":"Biography of William Tecumseh Sherman, his life and his Civil War campaign that defined much of modern warfare.  I had no idea how bold the march to Savannah really was."},{"author":"Chuck Yaeger","title":"Yaeger: An Autobiography","amazon_link":"http:\/\/amzn.to\/2iGFSEU","category":null,"notes_slug":null,"summary":"One of a number of military biographies I read this year.  The best US fighter pilot there was and first man to break the sound barrier."},{"author":"Kai Bird & Martin Sherwin","title":"American Prometheus","amazon_link":"http:\/\/amzn.to\/2iGIFKq","category":null,"notes_slug":null,"summary":"The life of Robert Oppenheimer, Los Alamos and the development of the atomic bomb and his subsequent pursecution during the Red Scare."},{"author":"Rob Goodman & Jimmy Soni","title":"Rome's Last Citizen","amazon_link":"http:\/\/amzn.to\/2iGSxna","category":null,"notes_slug":null,"summary":"Biography of Marcus Cato the Younger, enemy of both Caesar and Pompey.  One of the few men to fight for the idea of the Republic to the very end against dictators to the very end, choosing suicide over submission."},{"author":"Michael Lewis","title":"Moneyball","amazon_link":"http:\/\/amzn.to\/2hy3BqB","category":null,"notes_slug":null,"summary":"Someone uses data to overturn conventional wisdom and wins big.  Classic data scientist read.  Also useful for explaining what I do to regular people."},{"author":"Walter Isaacson","title":"Einstein: His Life and Universe","amazon_link":"http:\/\/amzn.to\/2hy8HDe","category":null,"notes_slug":null,"summary":"Sadly, not as good as Franklin.  Not because Isaacson wrote a poor book, but Einstein's life wasn't particulary interesting after general relativity."},{"author":"Oliver Burkeman","title":"The Antidote: Happiness for People Who Can't Stand Positive Thinking","amazon_link":"http:\/\/amzn.to\/2iH2X6n","category":null,"notes_slug":null,"summary":"I generally don't include subtitles here and I generally don't read much modern pop-philosophy.  This book is an exception.  It does a fantastic job of weaving many of my philosophical influences into one thread."},{"author":"Carl Anderson","title":"Creating a Data-Driven Organization","amazon_link":"http:\/\/amzn.to\/2hA5XVW","category":null,"notes_slug":null,"summary":"Good conceptual framework for the steps required to make data and data science effective at a company."},{"author":"Ryan Holiday","title":"The Daily Stoic","amazon_link":"http:\/\/amzn.to\/2iiGjlJ","category":null,"notes_slug":null,"summary":"Daily Stoicism reader.  It's on my bedside table, but I haven't opened it as much as I think I should."},{"author":"Steven Pressfield","title":"The Warrior Ethos","amazon_link":"http:\/\/amzn.to\/2hyalF8","category":null,"notes_slug":null,"summary":"I'm a big fan of Pressfield's writing and the mentality of doing one's duty.  This book scratches both those itches."},{"author":"Kevin Kelly","title":"The Inevitable","amazon_link":"http:\/\/amzn.to\/2iJFQIh","category":null,"notes_slug":null,"summary":"Founding editor of Wired discusses future trends in consumer Internet technology.  Kelly presents a fascinating view of the technological future, better framing things I had thought of and introducing many new ideas.  My main complaint is that it's an overly rosy picture that doesn't really consider societal impact of many of these changes."},{"author":"Edward Slingerland","title":"Trying Not to Try","amazon_link":"http:\/\/amzn.to\/2icWa7s","category":null,"notes_slug":null,"summary":"Ancient Chinese philosophy meets modern cognition.  Reframes the role of Kahneman's System 1 and System 2 in the constellation of Daoist with insights on how to make it applicable to your life."},{"author":"Tyler Cowen","title":"Average Is Over","amazon_link":"http:\/\/amzn.to\/2icOTEQ","category":null,"notes_slug":null,"summary":"Followup to _The Great Stagnation_ detailing the ongoing bifurcation of American society into the haves and the have-nots.  Economic forces will progressively reduce the middle class that has dominated the 20th century."},{"author":"Ryan Holiday","title":"Ego Is the Enemy","amazon_link":"http:\/\/amzn.to\/2iJwEUj","category":null,"notes_slug":null,"summary":"Another modern Stoicism book.  Holiday continues the Stoic tradition of distilling things to a series of life-hacks.  Love it, hate it, but if works, use it."},{"author":"Steven Pressfield","title":"The War of Art","amazon_link":"http:\/\/amzn.to\/2htJIvZ","category":null,"notes_slug":null,"summary":"Modern-day Marcus Aurelius reminding you to show up and do your assigned work professionally, as difficult as it may be."},{"author":"Oliver Sacks","title":"On the Move","amazon_link":"http:\/\/amzn.to\/2iJLbzm","category":null,"notes_slug":null,"summary":"Endearing autobiography.  I've always loved Sacks.  It was encouraging to read that someone I respect still felt he had no idea what he was doing at the age of 40."},{"author":"Jean Edward Smith","title":"Eisenhower in War and Peace","amazon_link":"http:\/\/amzn.to\/2hxchw0","category":null,"notes_slug":null,"summary":"I bought it for the perspective on the European theater, but was equally interested in his presidency."},{"author":"Michael Lewis","title":"Flash Boys","amazon_link":"http:\/\/amzn.to\/2icKcLe","category":null,"notes_slug":null,"summary":"The dark and dirty world of high-frequency trading.  This is absolutely nuts."},{"author":"Tyler Cowen","title":"The Great Stagnation","amazon_link":"http:\/\/amzn.to\/2imHjaW","category":null,"notes_slug":null,"summary":"We've run out of the major contributors to the last century of American growth.  The future will not continue at the same pace."},{"author":"Mason Currey","title":"[Daily Rituals: How Artists Work","amazon_link":"http:\/\/amzn.to\/2iKm9QD","category":null,"notes_slug":null,"summary":"Delightful little book recounting the daily rituals and working habits of many artists.  A wonderful diversity of approaches.  My only regret is he didn't include more scientists and thinkers."},{"author":"Daniel Kahneman","title":"Thinking, Fast and Slow","amazon_link":"http:\/\/amzn.to\/2hxgmjI","category":null,"notes_slug":null,"summary":"Summary of Kahnemann's research career into cognitive biases.  Got distracted after the first section.  While I think the book is right in broad strokes, I don't think we understand the brain well enough to consider the specifics gospel."},{"author":"Nathaniel Philbrick","title":"In the Heart of the Sea","amazon_link":"http:\/\/amzn.to\/2i4QjRk","category":null,"notes_slug":null,"summary":"True story of the whaleship Essex.  Attacked by sperm whale in the Pacific, it was Melville's inspiration for Moby Dick."},{"author":"John Vaillant","title":"The Golden Spruce","amazon_link":"http:\/\/amzn.to\/2iJXRtY","category":null,"notes_slug":null,"summary":"Man cuts down golden-needled tree on Haida Gwaii.  I mostly enjoyed it for the description of the British Columbian coastal wilderness."},{"author":"Winifred Gallagher","title":"Rapt: Attention and the Focused Life","amazon_link":"http:\/\/amzn.to\/2iiJh9Y","category":null,"notes_slug":null,"summary":"Author is diagnosed cancer, realizes her life is improved by living more in the present.  Sadly this book is mostly pop-psychology and doesn't introspect much how attention improved her life."},{"author":"Pedro Domingos","title":"The Master Algorithm","amazon_link":"The Master Algorithm","category":null,"notes_slug":null,"summary":"Summary of the major approaches to machine learning that turns into an ad for the author's research.  A few insights."},{"author":"Donald Barlett","title":"Howard Hughes: His Life and Madness","amazon_link":"http:\/\/amzn.to\/2ivcDBM","category":null,"notes_slug":null,"summary":"For as much as Hughes is a household name, I was surprised how little I knew about his life.  Hughes was a complete nut."}]